Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: The Commits tab shows a list of commits in reverse chronological order, similar to the output of the `git log` command.
es: La pestaña "Commits" muestra una lista de confirmaciones de cambio, en orden cronológico inverso, de forma similar a la salida del comando 'git log'.

source: ### The Perils of Rebasing ###
es: ### Los peligros de la reorganización ###

source: Doing so automatically runs `test-error.sh` on each checked-out commit until Git finds the first broken commit.
es: De esta forma, se irá ejecutando automáticamente `test-error.sh` en cada confirmación de cambios que se vaya extrayendo. Hasta que Git encuentre la primera donde se presenten problemas.

source: It turns out that you can write your own filters for doing substitutions in files on commit/checkout.
es: Auque resulta que también puedes escribir tus propios filtros para realizar sustituciones en los archivos al guardar o recuperar (commit/checkout).

source: Insert 18333fig0316.png Figure 3-16.
es: Insert 18333fig0316.png Figura 3-16.

source: This option is available only in Git 1.6.1 and later.
es: Este parámetro solo está disponible a partir de la versión 1.6.1 de Git.

source: You can also leave off one side of the syntax to have Git assume HEAD.
es: Es posible también omitir la parte final de la sentencia y dejar que Git asuma HEAD.

source: You should see something like this:
es: Y deberás ver algo así como esto:

source: Figure 3-7 illustrates the result.
es: La Figura 3-7 ilustra el resultado.

source: As you may remember from Chapter 1, Git doesn’t store data as a series of changesets or deltas, but instead as a series of snapshots.
es: Recordando lo citado en el capítulo 1, Git no los almacena de forma incremental (guardando solo diferencias), sino que los almacena como una serie de instantáneas (copias puntuales de los archivos completos, tal y como se encuentran en ese momento).

source: You must have around 7,000 loose objects or more than 50 packfiles for Git to fire up a real gc command.
es: Ya que es necesaria la presencia de unos 7.000 objetos sueltos o más de 50 archivos empaquetadores para que Git termine lanzando realmente un comando "gc".

source: See Chapter 9 for a more detailed discussion of Git refspecs and different things you can do with them.
es: Puedes ver el Capítulo 9 para una discusión más detallada acerca de los _refspecs_ de Git y los distintos usos que puedes darles.

source: If you have a complex workflow process that has a QA team pushing branches, developers pushing branches, and integration teams pushing and collaborating on remote branches, you can namespace them easily this way.
es: De esta forma, puedes asignar facilmente espacios de nombres. Y resolver así complejos flujos de trabajo donde tengas simultáneamente , por ejemplo, un equipo QA enviando ramas, varios desarrolladores enviando ramas también y equipos integradores enviando y colaborando en ramas remotas.

source: Now, Jessica makes a couple of commits on the `featureB` branch:
es: Y realiza un par de confirmaciones de cambios (commits) en la rama 'featureB':

source: Here I assume the connecting user is in the `$USER` environment variable, so your update script begins by gathering all the information you need:
es: Aqui, asumiremos que el usuario conectado queda reflejado en la variable de entorno '$USER', de tal forma que el script 'update' comienza recogiendo toda la información que necesitas:

source: If you can, encourage your contributors to use `format-patch` instead of `diff` to generate patches for you.
es: Si puedes, anima a tus colaboradoras a utilizar 'format-patch' en lugar de 'diff' cuando vayan a generar parches.

source: ### Server-Side Hook ###
es: ### Punto de enganche en el lado servidor ###

source: Then, you branched off that to make the client-side changes (`client`) and committed a few times.
es: Despues, vuelves a la rama original para hacer algunos cambios en la parte cliente (rama 'client'), y confirmas también esos cambios.

source: You’ve learned about all sorts of configuration settings, file-based attributes, and event hooks, and you’ve built an example policy-enforcing server.
es: Has aprendido todo tipo de ajustes de configuración, atributos basados en archivos e incluso enganches (hooks). Y has preparado un ejemplo de servidor con mecanismos para asegurar políticas determinadas.

source: You see how easy it is to take a Git repository, create a bare version, and place it on a server to which you and your collaborators have SSH access.
es: Como se vé, es sencillo crear un repositorio básico a partir de un repositorio Git, y ponerlo en un servidor donde tanto tú como tus colaboradores tengais acceso SSH.

source: # Customizing Git #
es: # Personalizando Git #

source: Because Git is designed to work with nearly any type of project, these tools are pretty generic, but they can often help you hunt for a bug or culprit when things go wrong.
es: Precisamente por estar Git diseñado para trabajar con casi cualquier tipo de proyecto, sus herramientas son bastante genéricas. Pero suelen ser de inestimable ayuda para cazar errores o las causas de los mismos cuando se detecta que algo va mal.

source: Insert 18333fig0522.png Figure 5-22.
es: Insert 18333fig0522.png Figura 5-22.

source: It’s also probably the most difficult protocol to set up.
es: Por otro lado, es también el protocolo más complicado de implementar.

source: You can override that by specifying the `+` in front of the refspec.
es: Puedes forzarlo indicando el signo `+` delante de la referencia.

source: Now you’ll learn a few of the more interesting options that you can set in this manner to customize your Git usage.
es: Ahora vas a aprender un puñado de nuevas e interesantes opciones que puedes utilizar para personalizar el uso de Git.

source: If you want John to have only read access to this project, you can do this instead:
es: Por ejemplo, si quieres que John tenga únicamente acceso de lectura sobre el proyecto, puedes hacer:

source: Figure 3-11 illustrates the result.
es: Figura 3-11 muestra el resultado.

source: If you’re a Windows programmer doing a Windows-only project, then you can turn off this functionality, recording the carriage returns in the repository by setting the config value to `false`:
es: Si eres un programador Windows, trabajando en un entorno donde solo haya máquinas Windows, puedes desconectar esta funcionalidad. Para almacenar CRLFs en el repositorio. Ajustando el parámero a 'false':

source: This basically asks Git to resolve a range of commits that are reachable from one commit but aren’t reachable from another.
es: Básicamente, se trata de pedir a Git que resuelva un rango de confirmaciones de cambio alcanzables desde una confirmación determinada, pero no desde otra.

source: To pull in the changes and prepopulate the commit message, use the `--squash` and `--no-commit` options as well as the `-s subtree` strategy option:
es: Para recuperar los cambios y rellenar el mensaje de la confirmación, se pueden emplear las opciones `--squash` y `--no-commit`, junto con la opción de estrategia `-s subtree`:

source: Therefore, the preferred method for collaborating with someone is to set up an intermediate repository that you both have access to, and push to and pull from that.
es: En este sentido, el método más recomendable para colaborar con otra persona es preparar un repositorio intermedio donde ambos tengais acceso, enviando (push) y recibiendo (pull) a o desde allí.

source: But enforcing this with a hook will work in older versions of Git, and you can modify it to do so only for certain users or whatever else you come up with later.
es: Pero haciendolo a través de un enganche (hook), podrá funcionar también en versiones anteriores de Git, podrás modificarlo para que actue únicamente sobre ciertos usuarios, o podrás realizar cualquier otra acción que estimes oportuna.

source: If you want to see the fifth prior value of the HEAD of your repository, you can use the `@{n}` reference that you see in the reflog output:
es: Por ejemplo, si se desea ver el quinto anterior valor de HEAD en el repositorio, se puede emplear la referencia '@{n}' mostrada por la salida de reflog:

source: Then you can add the submodule:
es: Después, Git permitirá la adicción del submódulo sin problemas:

source: Contributors don’t have to wait for the project to incorporate their changes — each party can work at their own pace.
es: Las personas colaboradoras no tienen por qué esperar a que sus cambios sean incorporados al proyecto, --cada cual puede trabajar a su propio ritmo--.

source: In Git, this is called _rebasing_.
es: Esto es lo que en Git llamamos _reorganizar_.

source: Git tells you the original commit where you wrote those lines, even if it was in another file.
es: Git suele indicar la confirmación de cambios original donde se escribieron las líneas, incluso si estas fueron escritas originalmente en otro archivo.

source: ## Packfiles ##
es: ## Archivos empaquetadores ##

source: Because a branch in Git is in actuality a simple file that contains the 40 character SHA-1 checksum of the commit it points to, branches are cheap to create and destroy.
es: Debido a que una rama Git es realmente un simple archivo que contiene los 40 caracteres de una suma de control SHA-1, (representando la confirmación de cambios a la que apunta), no cuesta nada el crear y destruir ramas en Git.

source: Some of these settings can also be specified for a path, so that Git applies those settings only for a subdirectory or subset of files.
es: Algunos de los ajustes que hemos vistos, pueden ser especificados para un camino (path) concreto, de tal forma que Git los aplicará unicamente para una carpeta o para un grupo de archivos determinado.

source: There is no canonical version of any project, which allows a project to move from one user to another seamlessly if the first author abandons the project.
es: No existe una versión canónica de ningún proyecto, lo que permite a cualquiera de ellos ser movido facilmente de un usuario a otro en el caso de que el primer autor lo abandone.

source: GitHub is also a commercial company that charges for accounts that maintain private repositories, but anyone can quickly get a free account to host as many open source projects as they want.
es: GitHub es también una compañia comercial, que cobra por las cuentas que tienen repositorios privados. Pero, para albergar proyectos públicos de código abierto, cualquiera puede crear una cuenta gratuita.

source: Working locally and having someone push to your remote server makes each history move forward differently.
es: Trabajando localmente y que otra persona esté llevando (push) algo al servidor remoto, hace que cada registro avance de forma distinta.

source: You can throw away the original `iss91` branch (losing commits C5 and C6) and merge in the other two.
es: Puedes descartar la rama 'iss91' (perdiendo las confirmaciones C5 y C6), y fusionar las otras dos.

source: For public, unauthenticated read access to your projects, you’ll want to move past the HTTP protocol and start using the Git protocol.
es: Para dar a tus proyectos un acceso público, sin autentificar, de solo lectura, querrás ir más allá del protocolo HTTP y comenzar a utilizar el protocolo Git.

source: The pros of file-based repositories are that they’re simple and they use existing file permissions and network access.
es: Las ventajas de los repositorios basados en carpetas y archivos, son su simplicicidad y el aprovechamiento de los permisos preexistentes de acceso.

source: You have to do this every time you pull down a submodule change in the main project.
es: Se necesita realizar este paso cada vez que se recupere (pull) un cambio del submódulo en el proyecto padre.

source: You may want to dog-ear this page, because you’ll need that command, and you’ll likely forget the syntax.
es: Puedes grabarte a fuego esta página, porque necesitarás ese comando y, lo más probable es que hayas olvidado su sintaxis.

source: The manual page for `git config` lists all the available options in quite a bit of detail.
es: La página de manual sobre 'git config' contiene una lista bastante detallada de todas las opciones disponibles.

source: If you change pick to edit on more lines, you can repeat these steps for each commit you change to edit.
es: Si se ha cambiado 'pick' por 'edit' en más de una línea, estos pasos se habrán de repetir por cada una de las confirmaciones de cambios a modificar.

source: With the interactive rebase tool, you can then stop after each commit you want to modify and change the message, add files, or do whatever you wish.
es: Dentro de la herramienta de reorganización interactiva, es posible detenerse justo tras cada confirmación de cambios a modificar. Para cambiar su mensaje, añadir archivos, o cualquier otra modificación.

source: You can reapply the one you just stashed by using the command shown in the help output of the original stash command: `git stash apply`.
es: Con el comando 'git stash apply', tal y como se indica en la salida del comando stash original, se pueden volver a aplicar los últimos cambios recien guardados.

source: Because the server-side method looks at the log of commits, and, at this point, the commit hasn’t been recorded yet, you must get your file listing from the staging area instead.
es: Debido a que el metodo del lado servidor utiliza el registro de confirmaciones de cambio, pero, sin embargo, aquí la confirmación no se ha registrado aún, la lista de archivos se ha de obtener desde el área de preparación (staging area).

source: If everything is cool, it fires up the `upload-pack` process and hands off the request to it.
es: Siendo todo correcto, el demonio lanzará el proceso `upload-pack` y procesara nuestra petición.

source: Next, you want to make sure you aren’t modifying files that are outside your ACL scope.
es: A continuación, se necesita también asegurarse de no estar modificando archivos fuera del alcance de tus permisos.

source: If you receive a patch over e-mail that you need to integrate into your project, you need to apply the patch in your topic branch to evaluate it.
es: Si vas a integrar en tu proyecto un parche recibido a través de un correo electrónico. Antes de poder evaluarlo, tendrás que incorporarlo a una de tus ramas puntuales.

source: Because you never added them to any commits, they’re considered dangling and aren’t packed up in your new packfile.
es: Porque nunca los has llegado a incluir en ninguna confirmación de cambios, no se han considerado como objetos definitivos y, por tanto, no han sido empaquetados.

source: Git comes with a couple of scripts that make some command-line tasks easier.
es: Git trae incluidos unos cuantos scripts para facilitar algunas de las tareas en la línea de comandos.

source: Before you start looking at the specific use cases, here’s a quick note about commit messages.
es: Antes de comenzar a revisar casos de uso específicos, vamos a dar una pincelada sobre los mensajes en las confirmaciones de cambios (commits).

source: Now you can set up your config file to use your custom merge resolution and diff tools.
es: Una vez preparado todo esto, puedes ajustar el archivo de configuración para utilizar tus herramientas personalizadas de comparación y resolución de conflictos.

source: If you’re serving a lot of traffic for a public project or serving a very large project that doesn’t require user authentication for read access, it’s likely that you’ll want to set up a Git daemon to serve your project.
es: Si has de servir mucho tráfico de un proyecto público o servir un proyecto muy grande, que no requiera autentificación para leer de él, un demonio Git es la respuesta.

source: If you do some work on your local master branch, and, in the meantime, someone else pushes to `git.ourcompany.com` and updates its master branch, then your histories move forward differently.
es: Si haces algún trabajo en tu rama 'master' local. Y, al mismo tiempo, alguna otra persona lleva (push) su trabajo al servidor 'git.ourcompany.com', actualizando la rama 'master' de allí. Te encontrarás con que ambos registros avanzan de forma diferente.

source: The dictator merges the lieutenants’ master branches into the dictator’s master branch.
es: El dictador fusiona las ramas master de los tenientes en su propia rama master.

source: If you want Git to try a bit more intelligently to resolve the conflict, you can pass a `-3` option to it, which makes Git attempt a three-way merge.
es: Si deseas más inteligencia por parte de Git al resolver conflictos, puedes pasarle la opción '-3', para que intente una fusión a tres bandas (three-way merge).

source: You’re also unlikely to want to have hundreds of remotes, each for someone who contributes only a patch or two.
es: También es muy posible que no quieras tener cientos de remotos, cada uno contribuyendo tan solo con un parche o dos.

source: back to this:
es: de vuelta a:

source: Now you can stage and commit files until you have several commits, and run `git rebase --continue` when you’re done:
es: Para, seguidamente, elaborar tantas confirmaciones de cambios como se desee, a base de pasar archivos al área de preparación y confirmarlos. Y, finalmente, teclear el comando `git rebase --continue` para completar la tarea.

source: The `--index-filter` option is similar to the `--tree-filter` option used in Chapter 6, except that instead of passing a command that modifies files checked out on disk, you’re modifying your staging area or index each time.
es: La opción `--index-filter` es similar a la `--tree-filter` vista en el capítulo 6. Se diferencia porque, en lugar de modificar archivos activados (checked out) en el disco, se modifica el área de preparación (staging area) o índice.

source: Gitosis has simple access controls as well.
es: Gitosis permite también sencillos controles de acceso.

source: Insert 18333fig0323.png Figure 3-23.
es: Insert 18333fig0323.png Figura 3-23.

source: If you create a new branch, add a submodule there, and then switch back to a branch without that submodule, you still have the submodule directory as an untracked directory:
es: Si se crea una rama, se añade un submódulo en ella y luego se retorna a una rama donde dicho submódulo no exista. La carpeta del submódulo sigue existiendo, solo que ahora queda como una carpeta sin seguimiento.

source: When all the work in your topic branch is ready to be integrated into a more mainline branch, the question is how to do it.
es: Cuando todo el trabajo presente en tu rama puntual esté listo para ser integrado en una rama de mayor rango, la cuestión es cómo hacerlo.

source: Insert 18333fig0402.png Figure 4-2.
es: Insert 18333fig0402.png Figura 4-2.

source: ### Staging and Unstaging Files ###
es: ### Introduciendo archivos en el area de preparación y sacandolos de ella ###

source: Insert 18333fig0318.png Figure 3-18.
es: Insert 18333fig0318.png Figura 3-18.

source: Regular developers work on their topic branch and rebase their work on top of master.
es: Los desarrolladores habituales trabajan cada uno en su rama puntual y reorganizan (rebase) su trabajo sobre la rama master.

source: These tools are very helpful if you modify a bunch of files and then decide that you want those changes to be in several focused commits rather than one big messy commit.
es: Estas herramientas son útiles, por ejemplo, cuando se modifican unos cuantos archivos y luego se decide almacenar esos cambios en una serie de confirmaciones de cambio focalizadas en lugar de en una sola confirmación de cambio entremezclada.

source: Name this remote `teamone`, which will be your shortname for that whole URL (see Figure 3-25).
es: Puedes denominar 'teamone' a este remoto, poniendo este nombre abreviado para la URL (ver Figura 3-25)

source: When new work is introduced by contributors, it’s collected into topic branches in the maintainer’s repository in a manner similar to what I’ve described (see Figure 5-24).
es: A medida que vamos introduciendo nuevos trabajos de las personas colaboradoras, estos se van recolectando en ramas puntuales en el repositorio de una persona gestora; de forma similar a como se ha ido describiendo (ver Figura 5-24).

source: If you leave off the `[localbranch]` portion, then you’re basically saying, “Take nothing on my side and make it be `[remotebranch]`.”
es: Si omites la parte '[ramalocal]', lo que estás diciendo es: "no cojas nada de mi lado y haz con ello [ramaremota]".

source: If you rebase commits that you’ve already pushed and then try to push again, or otherwise try to push a commit to a remote branch that doesn’t contain the commit that the remote branch currently points to, you’ll be denied.
es: Si reorganizas (rebase) confirmaciones de cambio (commit) que ya habias enviado y tratas de enviarlas (push) de nuevo. O si intentas enviar una confirmación a una rama remota que no contiene la confirmación actualmente apuntada por la rama. Normalmente, la operación te será denegada por la rama remota sobre la que pretendias realizarla.

source: This can consist of accepting and applying patches generated via `format-patch` and e-mailed to you, or integrating changes in remote branches for repositories you’ve added as remotes to your project.
es: Lo cual implicará saber aceptar y aplicar parches generados vía `format-patch`, enviados a tí a través de correo-e; o saber integrar cambios realizados en ramas de repositorios que añadirás como remotos a tu proyecto.

source: Git sends a line for each reference you’re updating with the old SHA, the new SHA, and the reference that is being updated.
es: Git envia una linea por cada referencia a actualizar, indicando el viejo SHA, el nuevo SHA y la referencia a actualizar.

source: If you want to be more specific about which commands are colored and how, or you have an older version, Git provides verb-specific coloring settings.
es: Cuando quieras ajustar específicamente, comando a comando, donde colorear y cómo colorear, (o cuando tengas una versión antigua de Git), puedes emplear los ajustes particulares de color.

source: If you were deleting a reference, you would see the opposite: all '0's on the right side.
es: Si estuvieras borrando una referencia existente, verias lo contrario: una clave todo '0's en el lado derecho.

source: At this point, you should be able to do most of the things in Git that you’ll need on the command line day to day and feel comfortable doing so.
es: En este punto, deberiamos ser capaces de realizar la mayoria de las acciones necesarias en el día a día con Git; realizandolas de manera confortable y segura.

source: You can create as many of these groups as you want, each containing different users and projects.
es: Puedes crear tantos grupos como desees, para diferentes usuarios y proyectos.

source: In the last few years, the UI has been refined until it’s as clean and easy to use as any system out there; but often, the stereotype lingers about the early Git UI that was complex and difficult to learn.
es: En los últimos años, el IU se ha refinado hasta llegar a ser tan limpio y sencillo de usar como el de cualquier otro sistema; pero frecuentemente, el estereotipo sigue mostrando a Git como complejo y dificil de aprender.

source: If you changed the same part of the same file differently in the two branches you’re merging together, Git won’t be able to merge them cleanly.
es: Si hay modificaciones dispares en una misma porción de un mismo archivo en las dos ramas distintas que pretendes fusionar, Git no será capaz de fusionarlas directamente.
